GroupBy & Aggregations (CRITICAL)

In [1]:
import pandas as pd

df = pd.DataFrame({
    "name": ["Alice", "Bob", "Charlie", "David", "Eve", "Frank"],
    "dept": ["HR", "HR", "IT", "IT", "IT", "HR"],
    "gender": ["F", "M", "M", "M", "F", "M"],
    "salary": [50000, 60000, 70000, 80000, 75000, 65000]
})

df

      name dept gender  salary
0    Alice   HR      F   50000
1      Bob   HR      M   60000
2  Charlie   IT      M   70000
3    David   IT      M   80000
4      Eve   IT      F   75000
5    Frank   HR      M   65000

Group by a column and calculate mean.

In [2]:
df.groupby("dept")["salary"].mean()

dept
HR    58333.333333
IT    75000.000000
Name: salary, dtype: float64

Group by multiple columns.

In [3]:
df.groupby(["dept", "gender"])["salary"].mean()

dept  gender
HR    F         50000.0
      M         62500.0
IT    F         75000.0
      M         75000.0
Name: salary, dtype: float64

Find count per category.

In [5]:
df.groupby("dept")["name"].count()

dept
HR    3
IT    3
Name: name, dtype: int64

Find top N values per group.

In [8]:
df.sort_values("salary", ascending=False).groupby("dept").head(2)

    name dept gender  salary
3  David   IT      M   80000
4    Eve   IT      F   75000
5  Frank   HR      M   65000
1    Bob   HR      M   60000

Aggregate using multiple functions.

In [9]:
df.groupby("dept")["salary"].agg(["mean", "max"])

              mean    max
dept
HR    58333.333333  65000
IT    75000.000000  80000